import React from "react";
import scss from "./Offer.module.scss";

const Offer = () => {
  return (
    <div id="offer" className={scss.Offer}>
      <div className="container">
        <div className={scss.offer}>
          <div className={scss.offer_text}>
            <h1>Что мы предлагаем</h1>
          </div>
          <div className={scss.block}>
            <div className={scss.box}>
              <h2>🍽</h2>
              <h1>3-разовое питание</h1>
              <p>
                В течение дня дети получают полноценное питание, что помогает
                поддерживать их энергию и здоровье.
              </p>
            </div>

            <div className={scss.box}>
              <h2>🍽</h2>
              <h1>3-разовое питание</h1>
              <p>
                В течение дня дети получают полноценное питание, что помогает
                поддерживать их энергию и здоровье.
              </p>
            </div>

            <div className={scss.box}>
              <h2>🍽</h2>
              <h1>3-разовое питание</h1>
              <p>
                В течение дня дети получают полноценное питание, что помогает
                поддерживать их энергию и здоровье.
              </p>
            </div>

            <div className={scss.box}>
              <h2>🍽</h2>
              <h1>3-разовое питание</h1>
              <p>
                В течение дня дети получают полноценное питание, что помогает
                поддерживать их энергию и здоровье.
              </p>
            </div>

            <div className={scss.box}>
              <h2>🍽</h2>
              <h1>3-разовое питание</h1>
              <p>
                В течение дня дети получают полноценное питание, что помогает
                поддерживать их энергию и здоровье.
              </p>
            </div>

            <div className={scss.box}>
              <h2>🍽</h2>
              <h1>3-разовое питание</h1>
              <p>
                В течение дня дети получают полноценное питание, что помогает
                поддерживать их энергию и здоровье.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Offer;
